In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
os.getcwd()

'C:\\Users\\PBANE\\OneDrive - Monsanto\\Migrated from My PC\\Documents\\DataScienceAnalytics\\ML_Kaggle\\Titanic'

In [3]:
os.chdir('C:\\Users\\PBANE\\OneDrive - Monsanto\\Migrated from My PC\\Documents\\DataScienceAnalytics\\ML_Kaggle\\Titanic\\Data')

In [4]:
titanic = pd.read_csv('train.csv')

In [43]:
titanic.head()

,PassengerId,survived,pClass,sex,age,sibSp,parCh,ticket,fare,cabin,embarked,firstName,surname,title,ageGroup
0,804,1,3,male,0.42,0,1,2625,8.5167,NaN,C,Assad Alexander,Thomas,Master.,"(-0.001, 1.0]"
1,756,1,2,male,0.67,1,1,250649,14.5000,NaN,S,Viljo,Hamalainen,Master.,"(-0.001, 1.0]"
2,470,1,3,female,0.75,2,1,2666,19.2583,NaN,C,Helene Barbara,Baclini,Miss.,"(-0.001, 1.0]"
3,645,1,3,female,0.75,2,1,2666,19.2583,NaN,C,Eugenie,Baclini,Miss.,"(-0.001, 1.0]"
4,79,1,2,male,0.83,0,2,248738,29.0000,NaN,S,Alden Gates,Caldwell,Master.,"(-0.001, 1.0]"

In [6]:
titanic['firstName'] = titanic['name'].str.split('.', n = 1, expand = True)[[1]]

In [7]:
titanic['surname'] = titanic['name'].str.split(',', n = 1, expand = True)[[0]]

In [8]:
titanic['title'] = titanic['name'].str.split().str.get(1)

In [9]:
titanic = titanic.drop('name', axis = 1)

In [68]:
titanic.head()

,PassengerId,survived,pClass,sex,age,sibSp,parCh,ticket,fare,cabin,embarked,firstName,surname,title,ageGroup
0,804,1,3,male,0.42,0,1,2625,8.5167,NotKnown,C,Assad Alexander,Thomas,Master.,"(-0.001, 1.0]"
1,756,1,2,male,0.67,1,1,250649,14.5000,NotKnown,S,Viljo,Hamalainen,Master.,"(-0.001, 1.0]"
2,470,1,3,female,0.75,2,1,2666,19.2583,NotKnown,C,Helene Barbara,Baclini,Miss.,"(-0.001, 1.0]"
3,645,1,3,female,0.75,2,1,2666,19.2583,NotKnown,C,Eugenie,Baclini,Miss.,"(-0.001, 1.0]"
4,79,1,2,male,0.83,0,2,248738,29.0000,NotKnown,S,Alden Gates,Caldwell,Master.,"(-0.001, 1.0]"

In [28]:
titanic.groupby(['pClass'])[['survived']].mean()

        survived
pClass
1       0.629630
2       0.472826
3       0.242363

In [32]:
titanic.pivot_table('survived', index = ['sex'], columns= ['pClass'])

pClass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [41]:
titanic['ageGroup'] = pd.cut(titanic['age'], [0, 1, 5, 10, 20, 40, 60, 80], include_lowest= True)

In [42]:
titanic.pivot_table('survived', index= 'ageGroup')

               survived
ageGroup
(-0.001, 1.0]  0.857143
(1.0, 5.0]     0.633333
(5.0, 10.0]    0.350000
(10.0, 20.0]   0.382609
(20.0, 40.0]   0.397403
(40.0, 60.0]   0.390625
(60.0, 80.0]   0.227273

In [67]:
titanic['cabin'] = titanic.cabin.fillna(value = 'NotKnown')